using System;
using System.Collections;
using System.Collections.Generic;
using System.Runtime.InteropServices;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.ComponentModel;
using System.IO;
using System.Security.Cryptography;
using System.Runtime.Serialization.Formatters.Binary;
using SubStreamHelper;

namespace AAPakEditor
{
    
    // We don't use ths struct anymore, but I'm keeping it around for now
    [StructLayout(LayoutKind.Explicit)]
    public struct AAPakFileInfoStruct
    {
        /*
        getdstring NAME 0x108 MEMORY_FILE
        get OFFSET longlong MEMORY_FILE
        get SIZE longlong MEMORY_FILE
        get XSIZE longlong MEMORY_FILE     # used for encryption alignment?
        get ZSIZE long MEMORY_FILE         # ???
        getdstring DUMMY 16 MEMORY_FILE    # MD5 Hash
        get DUMMY1 long MEMORY_FILE        # ???
        get TIMESTAMP longlong MEMORY_FILE # Creation TIMESTAMP
        get TIMESTAMP longlong MEMORY_FILE # Modification TIMESTAMP
        get DUMMY2 longlong MEMORY_FILE    # ???
        */
        [FieldOffset(0x000)] [MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x108)] public string name;
        [FieldOffset(0x108)] public Int64 offset;
        [FieldOffset(0x110)] public Int64 size;
        [FieldOffset(0x118)] public Int64 sizeDuplicate; // maybe compressed data size ? if used
        [FieldOffset(0x120)] public Int32 paddingSize; // ??
        [FieldOffset(0x124)] public byte[] md5;
        [FieldOffset(0x134)] public Int32 dummy1; // looks like padding, always 0 ?
        [FieldOffset(0x138)] public Int64 createTime;
        [FieldOffset(0x140)] public Int64 modifyTime;
        //[FieldOffset(0x138)] public System.Runtime.InteropServices.ComTypes.FILETIME createTime ;
        //[FieldOffset(0x140)] public System.Runtime.InteropServices.ComTypes.FILETIME modifyTime ;
        [FieldOffset(0x148)] public Int64 dummy2; // looks like padding, always 0 ?
    }

    /// <summary>
    /// File Details Block
    /// </summary>
    public class AAPakFileInfo : IComparable<AAPakFileInfo>
    {
        [MarshalAs(UnmanagedType.ByValTStr, SizeConst = 0x108)] public string name;
        public Int64 offset;
        public Int64 size;
        public Int64 sizeDuplicate; // maybe compressed data size ? if used
        public Int32 paddingSize; // ??
        public byte[] md5;
        public Int32 dummy1; // looks like padding, always 0 ?
        public Int64 createTime;
        public Int64 modifyTime;
        public Int64 dummy2; // looks like padding, always 0 ?

        public int CompareTo(AAPakFileInfo obj)
        {
            return this.name.CompareTo(obj.name);
        }
    }

    /// <summary>
    /// Pak Header Information
    /// </summary>
    public class AAPakFileHeader
    {
